In [2]:
import pandas as pd

In [8]:
df = pd.read_csv('ex1.csv')
df.head()

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [9]:
pd.read_table('ex1.csv', sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
! type ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [11]:
pd.read_csv('ex2.csv')

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [12]:
pd.read_csv('ex2.csv', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [16]:
pd.read_csv('ex2.csv', names = ['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
names = ['a','b','c','d','message']

In [18]:
pd.read_csv('ex2.csv', names = names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [21]:
! type csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [23]:
parsed = pd.read_csv('csv_mindex.csv', index_col = ['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [24]:
list(open('ex3.txt'))

['            A         B         C\n',
 'aaa -0.264438 -1.026059 -0.619500\n',
 'bbb  0.927272  0.302904 -0.032399\n',
 'ccc -0.264273 -0.386314 -0.217601\n',
 'ddd -0.871858 -0.348382  1.100491\n']

In [29]:
result = pd.read_table('ex3.txt')
result

               A         B         C
0  aaa -0.264438 -1.026059 -0.619500
1  bbb  0.927272  0.302904 -0.032399
2  ccc -0.264273 -0.386314 -0.217601
3  ddd -0.871858 -0.348382  1.100491

In [30]:
result = pd.read_table('ex3.txt',sep ='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [31]:
! type ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [33]:
pd.read_csv('ex4.csv')

                                                                      # hey!
a                                                  b        c   d    message
# just wanted to make things more difficult for... NaN      NaN NaN      NaN
# who reads CSV files with computers                anyway? NaN NaN      NaN
1                                                  2        3   4      hello
5                                                  6        7   8      world
9                                                  10       11  12       foo

In [36]:
pd.read_csv('ex4.csv', skiprows = [0,2,3], index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [37]:
! type ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [39]:
result = pd.read_csv('ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [40]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [42]:
result = pd.read_csv('ex5.csv', na_values = ['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [43]:
sentinels = {'message':['foo','NA'],'something':['two']}

In [45]:
pd.read_csv('ex5.csv', na_values = sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

逐块读取文本文件

In [53]:
pd.options.display.max_rows = 10  #最多显示10行

In [54]:
result = pd.read_csv('ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [55]:
pd.read_csv('ex6.csv', nrows = 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [57]:
chunker = pd.read_csv('ex6.csv', chunksize = 1000)
chunker

In [58]:
chunker = pd.read_csv('ex6.csv', chunksize = 1000)

In [63]:
tot  = pd.Series([])
for piece in chunker:
    tot =tot.add(piece['key'].value_counts(), fill_vaue = 0)
tot =  tot.sort_values(ascending = False)

In [64]:
tot[:10]

Series([], dtype: float64)

将数据写出到文本格式

In [65]:
data = pd.read_csv('ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [67]:
data.to_csv('out_test.csv')

In [68]:
! type out_test.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [70]:
import sys

In [71]:
data.to_csv(sys.stdout, sep = '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [72]:
data.to_csv(sys.stdout, na_rep = 'NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [74]:
dates = pd.date_range('1/1/2000', periods = 7)
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [76]:
import numpy as np
ts = pd.Series(np.arange(7), index  = dates)
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [77]:
ts.to_csv('tseries.csv')

In [79]:
! type tseries.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

处理分隔符格式

In [81]:
! type ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [82]:
import csv

In [83]:
f  = open('ex7.csv')

In [85]:
reader = csv.reader(f)
reader

In [86]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [92]:
with open('ex7.csv') as f:
    lines = list(csv.reader(f))
lines

[['a', 'b', 'c'], ['1', '2', '3'], ['1', '2', '3']]

In [93]:
header, values = lines[0],lines[1:]
header

['a', 'b', 'c']

In [94]:
data_dict = {h: v for h, v in zip(header, zip(*values))}#语法要记住

In [95]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [96]:
pd.DataFrame(data_dict)

   a  b  c
0  1  2  3
1  1  2  3

In [100]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'#写操作的行结束符，默认为'\r\n'
    delimiter = ';'#用于分隔字段的单字符字符串，默认为','
    quotechar = '"'#用于带有特殊字符（如分隔符）的字段用的引用符号，默认为“"”
    quoting = csv.QUOTE_MINIMAL#引用约定，csv.QUOTE_MINIMAL：只引用带有诸如分隔符之类的特殊字段
reader = csv.reader(f, dialect = my_dialect)

TypeError: argument 1 must be an iterator

JSON数据

In [101]:
import json

In [102]:
obj = """
{"name":"Wes",
"place_lived":["US","Spain","Germany"],
"pet":null,
"siblings":[{"name":"Scott",
              "age":30,
              "pets":["Zeus","Zzuko"]},
              {"name":"Katie",
               "age":38,
               "pets":["Sixes","Stache","Cisco"]}]}
"""
obj

'\n{"name":"Wes",\n"place_lived":["US","Spain","Germany"],\n"pet":null,\n"siblings":[{"name":"Scott",\n              "age":30,\n              "pets":["Zeus","Zzuko"]},\n              {"name":"Katie",\n               "age":38,\n               "pets":["Sixes","Stache","Cisco"]}]}\n'

In [105]:
result = json.loads(obj)
result

{'name': 'Wes',
 'place_lived': ['US', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zzuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [108]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "place_lived": ["US", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zzuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [111]:
siblings = pd.DataFrame(result['siblings'], columns = ['name','age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [112]:
! type example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [113]:
data = pd.read_json('example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [114]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [115]:
print(data.to_json(orient = 'records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

XML和HTML：Web信息收集

In [3]:
tables = pd.read_html('fdic_failed_bank_list.html')

In [4]:
len(tables)

1

In [5]:
failures = tables[0]

In [7]:
failures.head(10)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
5,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015","April 13, 2016"
6,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015","October 24, 2016"
7,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015","August 17, 2016"
8,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015","July 12, 2016"
9,Doral Bank En Espanol,San Juan,PR,32102,Banco Popular de Puerto Rico,"February 27, 2015","May 13, 2015"

In [9]:
close_timestamps = pd.to_datetime(failures['Closing Date'])

In [10]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

二级制数据格式

In [15]:
frame = pd.read_csv('ex1.csv')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
frame.to_pickle('frame_pickle')

In [17]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [21]:
import numpy as np
import pandas as pd
frame = pd.DataFrame({'a':np.random.randn(100)})
frame.head()

          a
0  0.259703
1 -1.460458
2  1.014307
3 -0.500749
4 -0.568570

In [22]:
store = pd.HDFStore('mydata.h5')

In [23]:
store['obj1'] = frame

In [24]:
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [26]:
store['obj1'].head()

          a
0  0.259703
1 -1.460458
2  1.014307
3 -0.500749
4 -0.568570

In [27]:
store.put('obj2',frame, format = 'table')

In [29]:
store.select('obj2',where = ['index >= 10 and index <= 15'])

           a
10  0.263518
11  2.029858
12  0.136728
13 -2.183599
14  1.799821
15  0.371298

In [31]:
store.close()

读取EXCEL文件

In [32]:
xlsx = pd.ExcelFile('ex1.xlsx')
xlsx

In [36]:
pd.read_excel(xlsx, 'Sheet1')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [38]:
frame = pd.read_excel('ex1.xlsx', 'Sheet1')
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [39]:
writer = pd.ExcelWriter('ex1.xlsx')

In [40]:
frame.to_excel(writer, 'Sheet1')

In [43]:
writer.save()

In [44]:
frame.to_excel('ex2.xlsx')

Web APIs 交互

In [46]:
import requests

In [47]:
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [49]:
resp = requests.get(url)

In [50]:
resp

In [51]:
data = resp.json()

In [52]:
data[0]['title']

'TST/CLN: engine fixture for tests/io/excel/test_readers.py'

In [53]:
issues = pd.DataFrame(data, columns = ['number','title','labels','state'])
issues

,number,title,labels,state
0,27139,TST/CLN: engine fixture for tests/io/excel/tes...,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
1,27138,Add MultiIndex._data and MultiIndex.array,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
2,27137,API: ExtensionArray.argsort places the missing...,[],open
3,27136,"PERF, BENCH: Fix performance issue when indexi...",[],open
4,27135,read_json different behaviour when file is os ...,[],open
5,27134,BUG: Timedelta repr doesn't show nano,[],open
6,27133,Add Index.__array_ufunc__,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
7,27132,DOC: tweak paragraph regarding cut and Interva...,[],open
8,27131,"DOC: add internal links to ""Endpoints are incl...",[],open
9,27130,BUG: Fix Series divmod #26987,[],open
10,27127,BUG: GH26944,[],open
11,27125,BUG: Index constructor should not allow an nda...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
12,27124,TST: flaky test test_agg_consistency on Python...,"[{'id': 76939933, 'node_id': 'MDU6TGFiZWw3Njkz...",open
13,27123,Allow 2D arrays in DataFrame.from_dict,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
14,27122,Regenerated Excel files to Suppress Openpyxl W...,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
15,27119,PERF: do not instantiate IndexEngine for stand...,[],open
16,27118,Plotting ExtensionArrays,[],open
17,27117,Make pandas.to_parquet handles partition colum...,"[{'id': 685114413, 'node_id': 'MDU6TGFiZWw2ODU...",open
18,27116,Bump python_requires to 3.5.3,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNT...",open
19,27110,BUG: Fix indexing on DatetimeBlock,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
20,27109,DEPR: remove deprecated date casting; closes #...,"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
21,27108,API: Add property to Index to disallow duplicates,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
22,27104,Partial indexing with list on MultiIndex with ...,"[{'id': 2822098, 'node_id': 'MDU6TGFiZWwyODIyM...",open
23,27101,CLN/DEPR: Final panel removal,"[{'id': 452722332, 'node_id': 'MDU6TGFiZWw0NTI...",open
24,27100,API: Implement new indexing behavior for inter...,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open
25,27099,Join operation takes more time.,[],open
26,27098,DEPR: DatetimeIndex.snap(),"[{'id': 87485152, 'node_id': 'MDU6TGFiZWw4NzQ4...",open
27,27096,Clean Up Testing of Excel Engine Option Settin...,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
28,27095,Shorter truncated Series/DataFrame repr: intro...,"[{'id': 13101118, 'node_id': 'MDU6TGFiZWwxMzEw...",open
29,27093,Change in column name creates an empty output ...,[],open

数据库交互

In [54]:
import sqlite3

In [55]:
query = """
       CREATE TABLE test
       (a VARCHAR(20),
        b VARCHAR(20),
        c REAL,
        d INTEGER);
        """

In [56]:
con = sqlite3.connect('mydata.sqlite')

In [57]:
con.execute(query)

In [59]:
con.commit()

In [60]:
data = [('Atalanta','Georgia',1.25,6),
       ('dada','dasff',2.6,1.3),('dsdas','dsfeaa',1.7,1.2)
       ]

In [61]:
data

[('Atalanta', 'Georgia', 1.25, 6),
 ('dada', 'dasff', 2.6, 1.3),
 ('dsdas', 'dsfeaa', 1.7, 1.2)]

In [64]:
stmt = 'INSERT INTO test VALUES(?,?,?,?)'

In [65]:
con.executemany(stmt, data)

In [67]:
cursor = con.execute('SELECT * FROM test')

In [68]:
rows = cursor.fetchall()

In [69]:
rows

[('Atalanta', 'Georgia', 1.25, 6),
 ('dada', 'dasff', 2.6, 1.3),
 ('dsdas', 'dsfeaa', 1.7, 1.2)]

In [70]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [71]:
pd.DataFrame(rows, columns = [x[0] for x in cursor.description])

          a        b     c    d
0  Atalanta  Georgia  1.25  6.0
1      dada    dasff  2.60  1.3
2     dsdas   dsfeaa  1.70  1.2

In [72]:
import sqlalchemy as sqla

In [78]:
db = sqla.create_engine('sqlite:///mydata.sqlite')

In [79]:
pd.read_sql('SELECT * FROM test', db)

Empty DataFrame
Columns: [a, b, c, d]
Index: []